package StreamStudy;


/**
 * stream 연산은 매개변수로 함수형 인터페이스를 받도록 되어있다.
 * 람다식은 반환값으로 함수형 인터페이스를 반환한다.
 * 즉, stream API를 정확하게 이해하기 위해 람다식과 함수형 인터페이스에 대해 알고 있어야 한다.
 *
 * 람다식은 함수를 하나의 식으로 표현한 것이다. 함수를 람다식으로 표현하면 메소드의 이름이 필요 없기 때문에,
 * 람다식은 익명 함수의 한 종류라고 볼 수 있다.
 * 익명함수란 함수의 이름이 없는 함수로, 익명함수들은 모두 일급 객체이다.
 *
 * 람다식의 특징
 * - 람다식 내에서 사용되는 지역변수는 final이 붙지 않아도 상주로 간주된다.
 * - 람다식으로 선언된 변수명은 다른 변수명과 중복될 수 없다.
 *
 * 람다식의 장점
 * - 코드를 간결하게 할 수 있다.
 * - 식에 개발자의 의도가 명확히 드러나 가독성이 높아진다.
 * - 함수를 만드는 과정없이 한번에 처리할 수 있어 생산성이 높아진다.
 * - 병렬 프로그래밍이 용이하다.
 *
 * 람다식의 단점
 * - 람다를 사용하면서 만든 함수는 재사용이 불가능하다.
 * - 디버깅이 어렵다.
 * - 람다를 남발하면 비슷한 함수가 중복 생성되어 코드가 지저분해질 수 있다.
 * - 재귀로 만들경우에 부적합하다.
 *
 * 함수형 인터페이스란?
 * 함수를 1급 객체처럼 다룰 수 있게 해주는 어노테이션으로, 인터페이스에 선언하여 단 하나의 추상 메소드만을
 * 갖도록 제한하는 역할을 한다.
 * 함수형 인터페이스를 사용하는 이유는 Java의 람다식이 함수형 인터페이스를 반환하기 때문이다.
 *
 * 출처(망나니 개발자)
 * https://mangkyu.tistory.com/113
 */
public class LamdaExpression {
	public static void main(String[] args) {
		LamdaFunction lamdaFunction = (a, b) -> Math.max(a, b);
		System.out.println(lamdaFunction.max(3, 5));
	}
}
@FunctionalInterface
interface LamdaFunction {
	int max(int a, int b);
}
